#!/bin/bash 
# Проверка номеров телефонов, вариативно меняем значения        
#grep -E '^\([0-9]{3}\) [0-9]{3}-[0-9]{4}$|^[0-9]{3}-[0-9]{3}-[0-9]{4}$' phonelist.txt 
#=======================================================================================
# Вывод построчно содержимого файла
# count=1                                      
# cat phonelist.txt | while read line
# do
# echo "Line $count: $line"
# count=$(( $count + 1 ))
# done
# echo "Finished"
#=======================================================================================
# Или с использованием STDIN
# exec 0< phonelist.txt
# count=1
# while read line
# do
# echo "Line #$count: $line"
# count=$(( $count + 1 ))
# done
#=======================================================================================

